README.org
#+TITLE: alpha-org

=alpha-org= is a powerful configuration for =org-mode=, similar to how [[http://spacemacs.org/][Spacemacs]] and [[https://github.com/hlissner/doom-emacs][Doom]] are configurations for Emacs as a whole.

* Usage

This can be used as a package which you [[*Installation][install]], or, since each feature is configured in its own =use-package= block, you may copy parts into your own config.

** Installation

The easiest way to install the whole thing is with [[https://framagit.org/steckerhalter/quelpa][Quelpa]] (which may be installed from [[https://melpa.org][MELPA]]), like so:

#+begin_src elisp :tangle no
  (quelpa '(alpha-org :fetcher github :repo "alphapapa/alpha-org"))
#+end_src

** Key Bindings

To best demonstrate the power of this configuration, it's necessary to bind some keys by default (because using =M-x= to access everything is relatively cumbersome).  While this config isn't designed to work with [[https://github.com/emacs-evil/evil][EVIL]], similar to Spacemacs, Doom, and Vim, all keys bound by this config are under a [[*%5B%5Bhttps://github.com/noctuid/general.el%5D%5BGeneral%5D%5D][prefix key]], which is =M-SPC= by default.

+ Sidebars
  + =vs= :: Show default sidebars (=org-sidebar-toggle=).
  + =vt= :: Show tree sidebar (=org-sidebar-tree-toggle=).

* TODO Tutorial

A step-by-step guide showing the use of some features would probably be helpful.

* Requirements

These packages must already be installed:

+  [[https://github.com/jwiegley/use-package][use-package]]

* Code
:PROPERTIES:
:header-args:elisp: :tangle alpha-org.el
:END:

** Header

This header is tangled to =alpha-org.el=, declaring package dependencies so that they can be installed automatically.

#+BEGIN_SRC elisp
;;; alpha-org.el --- A powerful Org configuration           -*- lexical-binding: t; -*-

;; Author: Adam Porter <adam@alphapapa.net>
;; Keywords: outlines

;; Package-Requires: ((emacs "26.3") (use-package) (general) (org-bullets) (org-make-toc) (org-sidebar) (org-sticky-header))

;;; License:

;; Copyright (C) 2019  Adam Porter

;; This program is free software; you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation, either version 3 of the License, or
;; (at your option) any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with this program.  If not, see <https://www.gnu.org/licenses/>.

;;; Commentary:

;; `alpha-org' is a powerful configuration for `org-mode', similar to
;; how Spacemacs and Doom are configurations for Emacs as a whole.

;;; Code:

;;;; Requirements

(require 'use-package)
#+END_SRC


** [[https://github.com/noctuid/general.el][General]]

General is used to ease configuration of key bindings.

#+begin_src elisp
  (use-package general
    :config
    (global-unset-key (kbd "M-SPC"))
    (general-create-definer alpha-org/general-def
      :prefix "M-SPC"))
#+end_src

*** TODO Prefix key variable?

Can I use a variable for this prefix key?

** Org Configuration

#+begin_src elisp
;;;; Configuration

;;  This section includes configuration code for options and packages built-in to Org.
#+end_src

*** Speed commands

Speed commands provide one-key bindings to quickly navigate and manipulate outlines.

#+begin_src elisp
  (use-package org-mode
    :custom
    (org-use-speed-commands (lambda ()
                              (and (looking-at org-outline-regexp)
                                   (looking-back "^\**")))))
#+end_src

**** TODO Link to Org documentation for speed command keys
*** org-indent-mode

 This mode displays text indented to match its heading's indentation.  Text is not actually indented in the buffer.

 #+BEGIN_SRC elisp
   (add-hook 'org-mode-hook 'org-indent-mode)
 #+END_SRC

**** TODO Comparison screenshot

** Org Packages

 These packages are included and configured by default.  Each package links to its configuration code later in this file.

#+begin_src elisp
;;;; Packages
#+end_src

*** Contents
    :PROPERTIES:
    :TOC:      siblings
    :END:
    -  [[#header][Header]]
    -  [[#httpsgithubcomnoctuidgeneralelgeneral][General]]
      -  [[#prefix-key-variable][Prefix key variable?]]
    -  [[#org-configuration][Org Configuration]]
      -  [[#speed-commands][Speed commands]]
        -  [[#link-to-org-documentation-for-speed-command-keys][Link to Org documentation for speed command keys]]
      -  [[#org-indent-mode][org-indent-mode]]
        -  [[#comparison-screenshot][Comparison screenshot]]
    -  [[#org-packages][Org Packages]]
      -  [[#agenda-01][Agenda {0/1}]]
        -  [[#org-super-agenda][org-super-agenda]]
      -  [[#appearance--ui-02][Appearance / UI {0/2}]]
        -  [[#org-sidebar][org-sidebar]]
          -  [[#screenshots][Screenshots]]
        -  [[#yequake][yequake]]
        -  [[#httpsgithubcomemacsorphanageorg-bulletsorg-bullets][org-bullets]]
          -  [[#screenshot][Screenshot]]
        -  [[#httpsgithubcomalphapapaorg-sticky-headerorg-sticky-header][org-sticky-header]]
          -  [[#screenshot][Screenshot]]
      -  [[#miscellaneous][Miscellaneous]]
        -  [[#httpsgithubcomalphapapaorg-make-tocorg-make-toc][org-make-toc]]
        -  [[#httpsgithubcomalphapapaunpackagedelunpackaged][unpackaged]]
      -  [[#searching-05][Searching {0/5}]]
        -  [[#helm-org][helm-org]]
        -  [[#org-ql][org-ql]]
        -  [[#org-recent-headings][org-recent-headings]]
        -  [[#org-web-tools][org-web-tools]]
        -  [[#org-bookmark-heading][org-bookmark-heading]]
    -  [[#footer][Footer]]

*** TODO Agenda [0/1]

**** TODO org-super-agenda

*** TODO Appearance / UI [0/2]


**** TODO org-sidebar

#+begin_src elisp
  (use-package org-sidebar
    :general
    (alpha-org/general-def
     "vs" #'org-sidebar-toggle
     "vt" #'org-sidebar-tree-toggle)
    :custom (org-sidebar-tree-side 'left))
#+end_src

***** TODO Screenshots

**** TODO yequake

 The ~yequake-org-capture~ function is used to provide a quick capturing UI with drop-down Emacs windows that disappear automatically when a capture is finalized or canceled.

**** [[https://github.com/emacsorphanage/org-bullets][org-bullets]]

  This mode replaces heading stars with visually appealing ones.  Its settings can be customized in the =org-bullets= group.

  #+BEGIN_SRC elisp
    (use-package org-bullets
      :hook (org-mode . org-bullets-mode))
  #+END_SRC

***** TODO Screenshot
**** [[https://github.com/alphapapa/org-sticky-header][org-sticky-header]]

This package displays in the header-line the Org heading for the node that’s at the top of the window. This way, if the heading for the text at the top of the window is beyond the top of the window, you don’t forget which heading the text belongs to. The display can be customized to show just the heading, the full outline path, or the full outline path in reverse.

#+BEGIN_SRC elisp
  (use-package org-sticky-header
    :hook (org-mode . org-sticky-header-mode))
#+END_SRC
***** TODO Screenshot
*** Miscellaneous

**** DONE [[https://github.com/alphapapa/org-make-toc][org-make-toc]]

This package automates customizeable tables of contents in Org files.

#+BEGIN_SRC elisp
  (use-package org-make-toc
    :hook (org-mode . org-make-toc-mode))
#+END_SRC

**** MAYBE [[https://github.com/alphapapa/unpackaged.el][unpackaged]]

Not sure if I should use it or move its Org-related code into this.

*** TODO Searching [0/5]

**** TODO helm-org
**** TODO org-ql
**** TODO org-recent-headings
**** TODO org-web-tools
**** TODO org-bookmark-heading
** Footer

#+begin_src elisp
;;;; Footer

(provide 'alpha-org)

;;; alpha-org.el ends here

#+end_src

* File Configuration

File-local configuration.

#+TODO: TODO MAYBE | DONE CANCELLED

# Local Variables:
# after-save-hook: org-babel-tangle
# eval: (visual-line-mode)
# End:
